#include <iostream>
#include <vector>
using namespace std;
typedef long long ll;

//  У Медузы есть n зеленых яблок со значениями a1,a2,…,an, а у Гедузы есть m зеленых яблок со значениями b1,b2,…,bm
// Они будут играть в игру, состоящую из k
// раундов. Для i=1,2,…,k

// в этом порядке они будут выполнять следующие действия:

//     Если i нечетное, то Медуза может поменять одно свое яблоко на одно яблоко Гедузы или ничего не делать.
//     Если i четное, то Гедуза может поменять одно из своих яблок на одно из яблок Медузы или ничего не делать. 

// Оба игрока хотят максимизировать сумму стоимостей своих яблок.

// Поскольку вы — один из самых умных людей в мире, Медуза хочет, чтобы вы сообщили ей окончательную сумму стоимости ее яблок после всех k
// раундов игры. Предположим, что и Медуза, и Гедуза играют оптимально, стремясь максимизировать сумму стоимостей своих яблок.

int main(){
    int t;
    cin >> t;
    while (t--){
        ll n, m, k;
        ll summ1 = 0, max1 = 0, max2 = 0, min1 = LLONG_MAX, min2 = LLONG_MAX;
        cin >> n >> m >> k;
        vector <ll> a(n);
        vector <ll> b(m);
        for (ll i = 0; i < n; i++){
            cin >> a[i];
            summ1 += a[i];
            max1 = max(max1, a[i]);
            min1 = min(min1, a[i]);
        }
        for (ll i = 0; i < m; i++){
            cin >> b[i];
            max2 = max(max2, b[i]);
            min2 = min(min2, b[i]);
        }
        



        if (min1 < max2){
            summ1 += max2 - min1;
        }
        if (k % 2 == 0){
            summ1 -= max(max1, max2) - min(min1, min2);
        }




        cout << summ1 << '\n';
    }
    return 0;
}
