#include <iostream>
using namespace std;

int main(){
    // & - Операция И;  ед на тех местах где у двух чисел единицы
    int n = 22 & 26;
    cout << n << '\n';

    // С помощью операции И можно проверить, является ли число x четным, т. к. x & 1 = 0, если x четно, и x & 1 = 1, если x нечетно


    // x нацело делится на 2**k, если x & (2**k − 1) = 0
    int x = 96;
    if ((x & 31) % 10 == 0){
        cout << true << '\n';
    }





    // | - Операция ИЛИ;  ед на тех местах где хотя бы у одного из двух чисел стоит единица
    int n1 = 22 | 26;
    cout << n1 << '\n';


    // ^ - Операция ИСКЛЮЧАЮЩЕЕ ИЛИ; ед на тех местах где у одного из двух чисел стоит 1, а у другого 0
    int n2 = 22 ^ 26;
    cout << n2 << '\n';


    // ~ - Операция НЕ; число в двоичном представлении которого все биты x инвертированы.
    int n3 = ~29;
    cout << n3 << '\n';


    // x << k - Операция поразрядного сдвига влево; дописывает в конец числа k нулей
    // x >> k - Операция поразрядного сдвига вправо; удаляет k последних бит
    // операция x << k соответствует умножению x на 2**k, а x >> k – делению x на 2**k с последующим округлением с недостатком до целого.
    int n4 = 14 << 2, n5 = 49 >> 3;
    cout << n4 << " " << n5 << '\n';

    // Дополнительные функции:
    // __builtin_clz(x) - количество нулей в начале двоичного представления
    // __builtin_ctz(x): количество нулей в конце двоичного представления
    // __builtin_popcount(x): количество единиц в двоичном представлении;
    //__builtin_parity(x): четность количества единиц в двоичном представлении.



    return 0;
}